Revit 2026 API

# DoubleClickAction Enumeration

---

Possible actions Revit can take in response to the user double-clicking on an element.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DoubleClickAction
```
```vb
Public Enumeration DoubleClickAction
```
```cpp
public enum class DoubleClickAction
```
```fsharp
type DoubleClickAction
```

| Member name | Value | Description |
| --- | --- | --- |
| ActivateView | 3 | Double-click should activate the view or schedule. |
| DeactivateView | 5 | Double-click should deactivate the active view. |
| EditFamily | 1 | Double-click should open the family for editing. |
| EditType | 2 | Double-click should take the user to the edit type dialog. |
| EnterEditMode | 4 | Double-click will enter a specific edit mode for the element. |
| NoAction | 0 | Double-clicks should be ignored. |

#### Reference

Autodesk.Revit.UI Namespace